cfeltch537/psoc6-realtime-processing/BLE_RTC_IMU.cydsn/CE218137_BLE_Proximity_RTOS01.cydsn/Generated_Source/PSoC6/CapSense_Configuration.h
/*******************************************************************************
* CSD Specific settings
*******************************************************************************/

/* CSD scan method settings */
#define CapSense_CSD_IDAC_AUTOCAL_EN          (1u)
#define CapSense_CSD_IDAC_GAIN                (CapSense_IDAC_GAIN_HIGH)
#define CapSense_CSD_SHIELD_EN                (0u)
#define CapSense_CSD_SHIELD_TANK_EN           (0u)
#define CapSense_CSD_CSH_PRECHARGE_SRC        (CapSense_CSH_PRECHARGE_VREF)
#define CapSense_CSD_SHIELD_DELAY             (CapSense_NO_DELAY)
#define CapSense_CSD_TOTAL_SHIELD_COUNT       (0u)
#define CapSense_CSD_SCANSPEED_DIVIDER        (4u)
#define CapSense_CSD_COMMON_SNS_CLK_EN        (0u)
#define CapSense_CSD_SNS_CLK_SOURCE           (CapSense_CLK_SOURCE_DIRECT)
#define CapSense_CSD_SNS_CLK_DIVIDER          (4u)
#define CapSense_CSD_INACTIVE_SNS_CONNECTION  (CapSense_SNS_CONNECTION_GROUND)
#define CapSense_CSD_IDAC_COMP_EN             (1u)
#define CapSense_CSD_IDAC_CONFIG              (CapSense_IDAC_SOURCING)
#define CapSense_CSD_RAWCOUNT_CAL_LEVEL       (85u)
#define CapSense_CSD_DUALIDAC_LEVEL           (50u)
#define CapSense_CSD_PRESCAN_SETTLING_TIME    (5u)
#define CapSense_CSD_SNSCLK_R_CONST           (1000u)
#define CapSense_CSD_VREF_MV                  (2133u)

/* CSD settings */
#define CapSense_CSD_ANALOG_STARTUP_DELAY_US  (0u)
#define CapSense_CSD_FINE_INIT_TIME           (10u)
#define CapSense_CSD_DEDICATED_IDAC_COMP_EN   (1u)
#define CapSense_CSD_AUTO_ZERO_EN             (0u)
#define CapSense_CSD_AUTO_ZERO_TIME           (15Lu)
#define CapSense_CSD_NOISE_METRIC_EN          (0u)
#define CapSense_CSD_NOISE_METRIC_TH          (1Lu)
#define CapSense_CSD_INIT_SWITCH_RES          (CapSense_INIT_SW_RES_MEDIUM)
#define CapSense_CSD_SENSING_METHOD           (0)
#define CapSense_CSD_SHIELD_SWITCH_RES        (CapSense_SHIELD_SW_RES_MEDIUM)
#define CapSense_CSD_GAIN                     (11Lu)

#define CapSense_CSD_F1PM_SWITCH_RES_LE_INIT     (1)
#define CapSense_CSD_F1PM_SWITCH_RES_LE_SCAN     (0)
#define CapSense_CSD_F2PT_SWITCH_RES_LE_INIT     (1)
#define CapSense_CSD_F2PT_SWITCH_RES_LE_SCAN     (0)
#define CapSense_CSD_HCAG_SWITCH_RES_LE_INIT     (1)
#define CapSense_CSD_HCAG_SWITCH_RES_LE_SCAN     (3)
#define CapSense_CSD_HCAV_SWITCH_RES_LE_INIT     (1)
#define CapSense_CSD_HCAV_SWITCH_RES_LE_SCAN     (0)
#define CapSense_CSD_HCBG_SWITCH_RES_LE_INIT     (1)
#define CapSense_CSD_HCBG_SWITCH_RES_LE_SCAN     (3)
#define CapSense_CSD_HCBV_SWITCH_RES_LE_INIT     (1)
#define CapSense_CSD_HCBV_SWITCH_RES_LE_SCAN     (3)

#define CapSense_CSD_SENSE_WIDTH_LE              (10)

#define CapSense_CSD_MFS_DIVIDER_OFFSET_F1       (1u)
#define CapSense_CSD_MFS_DIVIDER_OFFSET_F2       (2u)

/*******************************************************************************
* CSX Specific settings
*******************************************************************************/

/* CSX scan method settings */
#define CapSense_CSX_SCANSPEED_DIVIDER        (1u)
#define CapSense_CSX_COMMON_TX_CLK_EN         (0u)
#define CapSense_CSX_TX_CLK_SOURCE            (CapSense_CLK_SOURCE_PRSAUTO)
#define CapSense_CSX_TX_CLK_DIVIDER           (80u)
#define CapSense_CSX_MAX_FINGERS              (1u)
#define CapSense_CSX_MAX_LOCAL_PEAKS          (5u)
#define CapSense_CSX_IDAC_AUTOCAL_EN          (0u)
#define CapSense_CSX_IDAC_BITS_USED           (7u)
#define CapSense_CSX_RAWCOUNT_CAL_LEVEL       (40u)
#define CapSense_CSX_IDAC_GAIN                (CapSense_IDAC_GAIN_MEDIUM)
#define CapSense_CSX_SKIP_OVSMPL_SPECIFIC_NODES (0u)
#define CapSense_CSX_MULTIPHASE_TX_EN         (0u)
#define CapSense_CSX_MAX_TX_PHASE_LENGTH      (0u)

/* CSX settings */
#define CapSense_CSX_ANALOG_STARTUP_DELAY_US  (0u)
#define CapSense_CSX_AUTO_ZERO_EN             (0u)
#define CapSense_CSX_AUTO_ZERO_TIME           (15u)
#define CapSense_CSX_FINE_INIT_TIME           (4u)
#define CapSense_CSX_NOISE_METRIC_EN          (0u)
#define CapSense_CSX_NOISE_METRIC_TH          (1u)
#define CapSense_CSX_INIT_SWITCH_RES          (CapSense_INIT_SW_RES_MEDIUM)
#define CapSense_CSX_SCAN_SWITCH_RES          (CapSense_SCAN_SW_RES_LOW)
#define CapSense_CSX_INIT_SHIELD_SWITCH_RES   (CapSense_INIT_SHIELD_SW_RES_HIGH)
#define CapSense_CSX_SCAN_SHIELD_SWITCH_RES   (CapSense_SCAN_SHIELD_SW_RES_LOW)

#define CapSense_CSX_MFS_DIVIDER_OFFSET_F1    (1u)
#define CapSense_CSX_MFS_DIVIDER_OFFSET_F2    (2u)

/* Gesture parameters */
#define CapSense_GES_GLOBAL_EN                (0u)


/*******************************************************************************
* Global Parameter Definitions
*******************************************************************************/

/* RAM Global Parameters Definitions */
#define CapSense_CONFIG_ID                      (0x6EB2u)
#define CapSense_DEVICE_ID                      (0x0900u)
#define CapSense_HW_CLOCK                       (0x0BB8u)
#define CapSense_CSD0_CONFIG                    (0x0008u)

/*******************************************************************************
* Proximity0 initialization values for FLASH data structure
*******************************************************************************/
#define CapSense_PROXIMITY0_STATIC_CONFIG       (10241u)
#define CapSense_PROXIMITY0_NUM_SENSORS         (1u)

/*******************************************************************************
* Proximity0 initialization values for RAM data structure
*******************************************************************************/
#define CapSense_PROXIMITY0_RESOLUTION          (CapSense_RES16BIT)
#define CapSense_PROXIMITY0_FINGER_TH           (80u)
#define CapSense_PROXIMITY0_NOISE_TH            (50u)
#define CapSense_PROXIMITY0_NNOISE_TH           (200u)
#define CapSense_PROXIMITY0_HYSTERESIS          (10u)
#define CapSense_PROXIMITY0_ON_DEBOUNCE         (1u)
#define CapSense_PROXIMITY0_LOW_BSLN_RST        (10u)
#define CapSense_PROXIMITY0_IDAC_MOD0           (32u)
#define CapSense_PROXIMITY0_SNS_CLK             (4u)
#define CapSense_PROXIMITY0_SNS_CLK_SOURCE      (0u)
#define CapSense_PROXIMITY0_FINGER_CAP          (40u)
#define CapSense_PROXIMITY0_SIGPFC              (0u)
#define CapSense_PROXIMITY0_PROX_TOUCH_TH       (200u)

